{
    "package": {
        "elements": {
            "chunks": [
                {
                    "name": "hero",
                    "description": "The default hero unit, for use in the header of each page. This pattern evaluates a few options for its contents, appearance and inheritance, giving the editor fine grained control over the output while keeping it easy to configure.",
                    "category": "m_presentation"
                },{
                    "name": "heroTitles",
                    "description": "A basic pattern for displaying a large page header + subtitle. Because the hero unit is mainly there for presentation purposes, the titles contain no specific HTML hierarchy (H1/H2 or the likes).",
                    "category": "m_presentation"
                },{
                    "name": "heroVertical",
                    "description": "This hero unit is adapted for use in vertical scenarios, meaning there are no grid classes present. The content is stacked as link items instead.",
                    "category": "m_presentation"
                },{
                    "name": "galleryRowImage",
                    "description": "Basic image pattern, for use in gallery or slider. It can contain a lightbox link, which opens an enlargement of the image in a full-screen overlay window.",
                    "category": "m_presentation"
                },{
                    "name": "galleryRowImageCaption",
                    "description": "This pattern adds a caption to the image. You can choose to either show the caption in the lightbox enlargement only, or also as a subtitle in the image grid (or slide).",
                    "category": "m_presentation"
                },{
                    "name": "galleryRowImageLightbox",
                    "description": "This pattern evaluates if you should be able to open the image in a lightbox. If so, the required classes and properties are added to the default image.",
                    "category": "m_presentation"
                },{
                    "name": "accordionRowBasic",
                    "description": "",
                    "category": "m_presentation"
                },{
                    "name": "tabsRowBasic",
                    "description": "",
                    "category": "m_presentation"
                },{
                    "name": "flexibleRowInnerWrapper",
                    "description": "The content inside a flexible Accordion or Tab CB is entered as a nested layout, meaning it's wrapped in columns. To properly display these columns in a grid, an additional wrapper is needed.",
                    "category": "m_presentation"
                }
            ],

            "categories": [
                {
                    "name": "m_presentation",
                    "parent": "02_molecules"
                }
            ]
        }
    }
}